package com.zukxu.test.others.cosmic;

/**
 * <p>
 * Cosmic 编写
 * </p>
 *
 * @author xupu
 * @since 2022/12/15 16:23:34
 */
public class TestCosmic {

    public static void main(String[] args) {
        //0、需求描述
        String[] th = new String[]{ "气象局乡镇轮廓集合数据清除", "区县乡镇新增", "区县乡镇查询", "区县乡镇编辑", "区县乡镇删除", "区县乡镇轮廓数据匹配", "4级行政编码新增", "4级行政编码查询", "4级行政编码编辑", "4级行政编码删除", "4级行政编码乡镇轮廓数据匹配", "气象局乡镇轮廓集合数据预览", "气象局1级省份编码新增", "气象局1级省份编码查询", "气象局1级省份编码编辑", "气象局1级省份编码删除", "气象局1级省份编码匹配", "气象局2级地市编码新增", "气象局2级地市编码查询", "气象局2级地市编码编辑", "气象局2级地市编码删除", "气象局2级地市编码匹配", "气象局3级区县编码新增", "气象局3级区县编码查询", "气象局3级区县编码编辑", "气象局3级区县编码删除", "气象局3级区县编码匹配", "移动1级省份编码新增", "移动1级省份编码查询", "移动1级省份编码编辑", "移动1级省份编码删除", "移动1级省份编码匹配", "移动2级地市编码新增", "移动2级地市编码查询", "移动2级地市编码编辑", "移动2级地市编码删除", "移动2级地市编码匹配", "移动3级区县编码新增", "移动3级区县编码查询", "移动3级区县编码编辑", "移动3级区县编码删除", "移动3级区县编码匹配", "气象局1级移动1级码表关联", "气象局2级移动2级码表关联", "气象局3级移动3级码表关联" };

        String t1 = "输入{{th}}请求";
        String t2 = "根据{{th}}参数{{head}}数据";
        String t2a = "返回封装{{th}}结果，前端展示";
        String t3 = "记录{{th}}日志";
        String d1 = "{{d}}id，{{d}}编码，{{d}}名称，{{d}}创建时间";
        for(String s : th) {
            //1、子过程描述
            /*System.out.println(t1.replace("{{th}}", s));
            System.out.println(t2.replace("{{th}}", s).replace("{{head}}", s.substring(s.length() - 2)));
            System.out.println(t2a.replace("{{th}}", s));
            System.out.println(t3.replace("{{th}}", s));*/
            //2、数据移动类型
            /*System.out.println("E\n" +
                               "R\n" +
                               "W\n" +
                               "E");*/
            //3、数据组
            for(int i = 0; i < 4; i++) {
                System.out.println(s.substring(0, s.length() - 2) + "\t" + d1.replace("{{d}}", s));
            }

        }
    }

}
